lst_1 = [1, 2, 3, 4, 5]
lst_2 = [7, 8, 9, 10]
lst_3 = [11, 12, 13, 14]
a = 3
print(f"Cписок целых чисел: {lst_1}")


# ==================================================================
# === Функция, вычисляющая произведение элементов списка целых======
# ==================================================================
def multiplication(lst_1):
    x = 1
    for i in lst_1:
        if i != 0:
            x *= i
        else:
            x == 0
            print("Произведение элементов списка целых равняется нулю.")
            break
    return f"Произведение элементов списка целых: {x}"


# ==================================================================
# ============ Функция для нахождения минимума в списке целых ======
# ==================================================================
def minimum(lst_1):
    return f"Минимум в списке: {min(lst_1)}"


# ==================================================================
# === Функция для нахождения количества простых чисел в списке =====
# ==================================================================
def prime(lst_1):
    count = 0
    for i in lst_1:
        if all(i % j != 0 for j in range(2, i)):
            count += 1
    return f"Kоличество простых чисел в списке целых: {count}"


# ==================================================================
# == Функция, удаляющая из списка целых некоторое заданное числох ==
# ==================================================================
def dell_n(lst_1, lst_2):
    count_d = 0
    for i in lst_2:
        if i in lst_1:
            lst_1.remove(i)
            count_d += 1
    return f"Количество удаленных элементов: {count_d}"


# ==================================================================
# ==================== Объединение списков =========================
# ==================================================================
def all_list(lst_1, lst_3):
    return f"Cписок, содержащий элементы обоих списков: {lst_1 + lst_3}"


# ==================================================================
# ==== Функция, высчитывающая степень каждого элемента списка ======
# ==================================================================
def p(lst_1, a):
    new_lst = []
    for i in lst_1:
        new_lst.append(i ** a)
    return f"Новый список, где каждый элемент находится в степени {a}: {new_lst}"


print(multiplication(lst_1))
print(minimum(lst_1))
print(prime(lst_1))
print(dell_n(lst_1, lst_2))
print(all_list(lst_1, lst_3))
print(p(lst_1, a))

# Вывод:
# Cписок целых чисел: [1, 2, 3, 4, 5]
# Произведение элементов списка целых: 120
# Минимум в списке: 1
# Kоличество простых чисел в списке целых: 4
# Количество удаленных элементов: 0
# Cписок, содержащий элементы обоих списков: [1, 2, 3, 4, 5, 11, 12, 13, 14]
# Новый список, где каждый элемент находится в степени 3: [1, 8, 27, 64, 125]
