from pprint import pprint

# Задача №4

data = {
    "автор": 0,
    "жанр": 1,
    "год выпуска": 2,
    "Количество страниц": 3,
    "Издательство": 4
}
books = {
    "Видоизмененный углерод": ["Ричард Морган", "фантастика", 2002, 524, "АСТ"],
    "Дюна": ["Фрэнк Герберт", "фантастика", 1965, 736, "Chilton Books"],
    "Автостопом по Галактике": ["Дуглас Адамс", "фантастика", 1979, 640, "Pan Books"],
    "Солярис": ["Станислав Лем", "фантастика", 1961, 204, "-"],
    "1984": ["Джордж Оруэлл", "роман", 1949, 800, "Secker and Warburg"],
    "Мечтают ли андроиды об электроовцах?": ["Филип Киндред Дик", "роман", 1968, 210, "Doubleday"],
}
# Добавление
books["Гиперион"] = " Дэн Симмонс", "фантастика", 1989, 482, "Doubleday"
# Удаление
books.pop("Гиперион")
# Поиск
books.get("Дюна")
pprint(books.get("Дюнаааааааа"))
# Замена данных
pprint(books["Солярис"])
books["Солярис"] = "Станислав Лем", "фантастика", 1961, 204, "Wydawnictwo Ministerstwa Obrony Narodowej"

pprint(books)
# ===============================================================