from pprint import pprint

# Задача №3

data = {
    "телефон": 0,
    "e-mail": 1,
    "название должности": 2,
    "номер кабинета": 3,
    "skype": 4
}
firm = {
    "Владимир Чёкаво": [+375111111111, "11111@gmail.com", "директор", 1, "1vch.live"],
    "Ирина Филиппова": [+375222222222, "2222222@gmail.com", "зам директора", 2, "2if.live"],
    "Виктория Горбенкова": [+375333333333, "3333333@gmail.com", "ком директор", 3, "3vg.live"],
    "Сергей Гур": [+375444444444, "4444444@gmail.com", "секретарь", 4, "4sg.live"],
    "Сергей Андреев": [+375555555555, "5555555@gmail.com", "начальник отдела", 5, "5sa.live"],
    "Ирина Козлова": [+375666666666, "6666666@gmail.com", "менеджер", 6, "6ik.live"],
    "Богдан Самуйлов": [+375777777777, "7777777@gmail.com", "кладовщик", 7, "7bs.live"],
}
# Добавление
firm["Федор Чайчиц"] = +375888888888, "8888888@gmail.com", "менеджер", 8, "8fc.live"
# Удаление
firm.pop("Федор Чайчиц")
# Поиск
firm.get("Сергей Андреев")
pprint(firm.get("Сергей Андреевевевев"))
# Замена данных
pprint(firm["Ирина Филиппова"])
firm["Ирина Филиппова"] = +375222222223, "2222223@gmail.com", "зам директора", 1, "23if.live"

pprint(firm)
# ===============================================================